perf/ping/load_testing/load_testing_2.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 0
    - name: Plain
      duration: 60
      arrivalRate: 100
    - name: Plain
      duration: 20
      arrivalRate: 0

scenarios:
  - name: load testing 2 (/)
    flow:
      - get:
          url: '/ping'